## software_asset_inventory
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`
```terraform
Plan: 1 to add, 1 to change, 0 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_ecs_service.dependencytrack_api will be updated in-place
  ~ resource "aws_ecs_service" "dependencytrack_api" {
        id                                 = "arn:aws:ecs:ca-central-1:794722365809:service/software_asset_tracking/dependencytrack_api"
        name                               = "dependencytrack_api"
        tags                               = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-software-asset-inventory"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:794722365809:task-definition/dependencytrack_api:14" -> (known after apply)
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.dependencytrack_api will be created
  + resource "aws_ecs_task_definition" "dependencytrack_api" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu              = 4096
                  + environment      = [
                      + {
                          + name  = "ALPINE_CORS_ALLOW_CREDENTIALS"
                          + value = "true"
                        },
                      + {
                          + name  = "ALPINE_CORS_ALLOW_HEADERS"
                          + value = "Origin, Content-Type, Authorization, X-Requested-With, Content-Length, Accept, Origin, X-Api-Key, X-Total-Count, *"
                        },
                      + {
                          + name  = "ALPINE_CORS_ALLOW_METHODS"
                          + value = "GET, POST, PUT, DELETE, OPTIONS"
                        },
                      + {
                          + name  = "ALPINE_CORS_ALLOW_ORIGIN"
                          + value = "*"
                        },
                      + {
                          + name  = "ALPINE_CORS_ENABLED"
                          + value = "true"
                        },
                      + {
                          + name  = "ALPINE_CORS_MAX_AGE"
                          + value = "3600"
                        },
                      + {
                          + name  = "ALPINE_DATABASE_DRIVER"
                          + value = "org.postgresql.Driver"
                        },
                      + {
                          + name  = "ALPINE_DATABASE_DRIVER_PATH"
                          + value = "/extlib/postgresql-42.2.5.jar"
                        },
                      + {
                          + name  = "ALPINE_DATABASE_MODE"
                          + value = "external"
                        },
                      + {
                          + name  = "ALPINE_DATABASE_POOL_ENABLED"
                          + value = "false"
                        },
                      + {
                          + name  = "ALPINE_DATABASE_URL"
                          + value = "jdbc:postgresql://dependency-track-proxy.proxy-cjgksqbmhiov.ca-central-1.rds.amazonaws.com:5432/dtrack"
                        },
                    ]
                  + essential        = true
                  + image            = "dependencytrack/apiserver:4.5.0@sha256:9365f306ac54eaf1216ad8f2846062b3fe538399d8fb10a11e82be20c8c8e797"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/dependencytrack_api"
                          + awslogs-region        = "ca-central-1"
                          + awslogs-stream-prefix = "dependencytrack_api-task"
                        }
                    }
                  + mountPoints      = [
                      + {
                          + containerPath = "/data"
                          + readOnly      = false
                          + sourceVolume  = "dependencytrack_api"
                        },
                    ]
                  + name             = "dependencytrack_api"
                  + portMappings     = [
                      + {
                          + containerPort = 8080
                          + hostPort      = 8080
                          + protocol      = "tcp"
                        },
                    ]
                  + secrets          = [
                      + {
                          + name      = "ALPINE_DATABASE_USERNAME"
                          + valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/dependencytrack/dependencytrack_db_user"
                        },
                      + {
                          + name      = "ALPINE_DATABASE_PASSWORD"
                          + valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/dependencytrack/dependencytrack_db_password"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "4096"
      + execution_role_arn       = "arn:aws:iam::794722365809:role/dependencytrack_api_container_execution_role"
      + family                   = "dependencytrack_api"
      + id                       = (known after apply)
      + memory                   = "16384"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-software-asset-inventory"
          + "Terraform"  = "true"
        }
      + task_role_arn            = "arn:aws:iam::794722365809:role/dependencytrack_execution_role"

      + volume {
          + name = "dependencytrack_api"

          + efs_volume_configuration {
              + file_system_id     = "fs-00d2fbd255781e5ec"
              + root_directory     = "/"
              + transit_encryption = "ENABLED"

              + authorization_config {
                  + access_point_id = "fsap-097132859e0c22c68"
                  + iam             = "DISABLED"
                }
            }
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
